[{"id":1,"img":"https://ctl.s6img.com/society6/img/9YqfVtjyxZXcUuXzoVPH14R081U/w_700/wall-clocks/front/natural-frame/white-hands/~artwork,fw_3502,fh_3504,fx_-5,fy_-3,iw_3479,ih_3476/s6-original-art-uploads/society6/uploads/misc/548a96021d5843e7bb97a04085888519/~~/map-of-bangladesh-with-typography-international-mother-language-day-wall-clocks.jpg","title":"BEGINNER COURSES","name":"Bengali Language","desc":"Are you planning on visiting Bangladesh? Do you wish learning Bengali was an easy thing to do? Do you wish you were be able to communicate easily with Bengali speakers when traveling around the world or in your own country?If so, this simple, easy and humorous Bengali course, will give you the tools to communicate effectively with Indian speakers anywhere in the world.This course takes you from learning how to pronounce Bengali words correctly to understanding others and expressing your needs in a number of situations."},{"id":2,"img":"https://media.architecturaldigest.com/photos/5ef5f6b4e5c8c1d259c3b00b/master/pass/GettyImages-803432314.jpg","title":"COURSES","name":"French Language","desc":"students study four French skills - reading, writing, speaking and listening - through a \"Communicative Language Teaching\" methodology. New grammar patterns are learned in the context of a conversation or a real-life situation. Students also use various activities to practice French conversation including listening tasks, role plays, and discussions. Practical reading and writing tasks and vocabulary studies are presented as well in our 6 available levels. Students can begin on any Monday."},{"id":3,"img":"https://i.guim.co.uk/img/media/2aaf0853eab6caf4639cac0c95a39843a4b48693/21_0_3161_1897/master/3161.jpg?width=445&quality=45&auto=format&fit=max&dpr=2&s=60339ff2ed42fa7452dbbb0ec7d15cab","title":"COURSES","name":"Spanish Language","desc":"A communicative approach to language learning is used to improve and increase students’ listening, speaking, reading, writing, and study skills. Students explore the diverse cultures and peoples of the Spanish-speaking world. Students complete several projects pertaining to Spain and Latin America. In class, Spanish is the primary language spoken by both teacher and students."},{"id":4,"img":"https://blog.alison.com/wp-content/uploads/2021/07/New-Project-7.jpg","title":"COURSES","name":"Weekend Courses","desc":"Friday classes are for students who are busy during the week and want to improve their English language skills. Covering an aspect of grammar and a speaking task each weeks, students can quickly improve their speaking, writing and listening skills."},{"id":5,"img":"https://ychef.files.bbci.co.uk/976x549/p06pr6yj.jpg","title":"BEGINNER COURSES","name":"Children Courses","desc":"The four inlingua language programs, DOTS, Bubbles, Junior, and Go World, have been created for children from ages 1 to 14. These programs offer children a great opportunity to learn new languages in a lively and comfortable environment. Classes are divided by age which enables kids to interact with their peers and feel confident while learning."},{"id":6,"title":"COURSES","name":"Intermediate","desc":"This is a Masterclass where you learn and really practice the English language at an Intermediate English level - your English speaking, your English grammar, your English vocabulary, your English listening, reading and writing. You can complete 10 Intermediate English Language Projects and you even learn 10 new study skills! ... And so much more."},{"id":7,"img":"https://q8v3g6g4.rocketcdn.me/wp-content/uploads/2020/06/German-Courses.png","title":"BEGINNER COURSES","name":"German Language","desc":"The Best Free German Online Courses (Other than Goethe Inst.) Easy Online German is a complete German course for beginners and intermediate students with focus on all the most important language learning topics including grammar, basic everyday vocabulary, listening comprehension and pronunciation. Everything is explained in English, so the course is also suitable for an absolute beginner."},{"id":8,"img":"https://q8v3g6g4.rocketcdn.me/wp-content/uploads/2020/01/Russian-Courses.png","title":"BEGINNER COURSES","name":"Russian Language","desc":"This program is a great solution if you don’t want to be stuck in one city, and learn Russian while discovering the country. The idea behind Immersion in Russia is to break the barriers between Russia and the students by creating an opportunity for all to immerse deeply into Russian culture through language, travel, and adventure."}]